**Import modules**

In [55]:
import warnings
warnings.simplefilter('ignore', FutureWarning)

from pandas import *

**Read CSV file**

In [56]:
df = read_csv('WHO POP TB all.csv')

**Display columns from dataframe**

In [57]:
df.columns

Index(['Country', 'Population (1000s)', 'TB deaths'], dtype='object')

**Display Row content with Index 0**

In [58]:
df.iloc[0]

Country               Afghanistan
Population (1000s)          30552
TB deaths                 13000.0
Name: 0, dtype: object

**Display Row content with Index 2**

In [59]:
df.iloc[2]

Country               Algeria
Population (1000s)      39208
TB deaths              5100.0
Name: 2, dtype: object

**display the first five rows in the dataframe**

In [60]:
df.head()

       Country  Population (1000s)  TB deaths
0  Afghanistan               30552   13000.00
1      Albania                3173      20.00
2      Algeria               39208    5100.00
3      Andorra                  79       0.26
4       Angola               21472    6900.00

**display the first x rows in the dataframe, specify x**

In [61]:
df.head(10)

               Country  Population (1000s)  TB deaths
0          Afghanistan               30552   13000.00
1              Albania                3173      20.00
2              Algeria               39208    5100.00
3              Andorra                  79       0.26
4               Angola               21472    6900.00
5  Antigua and Barbuda                  90       1.20
6            Argentina               41446     570.00
7              Armenia                2977     170.00
8            Australia               23343      45.00
9              Austria                8495      29.00

**display the last five rows in the dataframe**

In [62]:
df.tail()

                                Country  Population (1000s)  TB deaths
189  Venezuela (Bolivarian Republic of)               30405      480.0
190                            Viet Nam               91680    17000.0
191                               Yemen               24407      990.0
192                              Zambia               14539     3600.0
193                            Zimbabwe               14150     5700.0

**display the last x rows in the dataframe, specify x**

In [63]:
df.tail(10)

                                Country  Population (1000s)  TB deaths
184         United Republic of Tanzania               49253     6000.0
185            United States of America              320051      490.0
186                             Uruguay                3407       40.0
187                          Uzbekistan               28934     2200.0
188                             Vanuatu                 253       16.0
189  Venezuela (Bolivarian Republic of)               30405      480.0
190                            Viet Nam               91680    17000.0
191                               Yemen               24407      990.0
192                              Zambia               14539     3600.0
193                            Zimbabwe               14150     5700.0

**display the first 5 rows in the TB deaths column**

In [64]:
df['TB deaths'].head()

0    13000.00
1       20.00
2     5100.00
3        0.26
4     6900.00
Name: TB deaths, dtype: float64

**display the row value with first or specified Index from the TB deaths column**

In [65]:
df['TB deaths'].iloc[0]

13000.0

In [66]:
df['TB deaths'].iloc[2]

5100.0

**display first 5 row values from one or more selected columns as a new dataframe in its own right**

In [67]:
df[['Country']].head()

       Country
0  Afghanistan
1      Albania
2      Algeria
3      Andorra
4       Angola

**display first 5 row values from more selected columns as a new dataframe in its own right**

In [68]:
df[['Country','Population (1000s)']].head()

       Country  Population (1000s)
0  Afghanistan               30552
1      Albania                3173
2      Algeria               39208
3      Andorra                  79
4       Angola               21472

**operators**

==  equals

!=  not equal

<   less than

>   greater than

<=  less than or equal to 

>=  greater than or equal to

**examples**

2 = = 2      evaluates to True

2 + 2 = = 5  evaluates to False

2 != 1 + 1   evaluates to False

45 < 50      evaluates to True

20 > 30      evaluates to False

100 <= 100   evaluates to True

101 >= 100   evaluates to True

In [69]:
'aardvark' < 'zebra' # evaluates to True: alphabetical order

True

In [70]:
df['Country'] >= 'K' # will compare the country names, row by row, against the string 'K' and record whether the result is True or False

0      False
1      False
2      False
3      False
4      False
       ...
189     True
190     True
191     True
192     True
193     True
Name: Country, Length: 194, dtype: bool

# returns a new dataframe with all the columns of df but with only the rows corresponding to countries starting with K or a letter later in the alphabet

In [72]:
df[df['Country'] >= 'K']

                                Country  Population (1000s)  TB deaths
87                           Kazakhstan               16441     1600.0
88                                Kenya               44354     9100.0
89                             Kiribati                 102       30.0
90                               Kuwait                3369       33.0
91                           Kyrgyzstan                5548      620.0
..                                  ...                 ...        ...
189  Venezuela (Bolivarian Republic of)               30405      480.0
190                            Viet Nam               91680    17000.0
191                               Yemen               24407      990.0
192                              Zambia               14539     3600.0
193                            Zimbabwe               14150     5700.0

[107 rows x 3 columns]

# display a new dataframe with all the columns of df but with only the rows where it is True that the value in the 'Population (1000s)' column is greater than 80000

In [73]:
df[df['Population (1000s)'] > 80000]

                      Country  Population (1000s)  TB deaths
13                 Bangladesh              156595    80000.0
23                     Brazil              200362     4400.0
36                      China             1393337    41000.0
53                      Egypt               82056      550.0
58                   Ethiopia               94101    30000.0
65                    Germany               82727      300.0
77                      India             1252140   240000.0
78                  Indonesia              249866    64000.0
85                      Japan              127144     2100.0
109                    Mexico              122332     2200.0
124                   Nigeria              173615   160000.0
128                  Pakistan              182143    49000.0
134               Philippines               98394    27000.0
141        Russian Federation              142834    17000.0
185  United States of America              320051      490.0
190                  Viet Nam               91680    17000.0

find all the rows in df where TB deaths exceed 10000

In [74]:
df[df['TB deaths'] > 10000]

                              Country  Population (1000s)  TB deaths
0                         Afghanistan               30552    13000.0
13                         Bangladesh              156595    80000.0
36                              China             1393337    41000.0
47   Democratic Republic of the Congo               67514    46000.0
58                           Ethiopia               94101    30000.0
77                              India             1252140   240000.0
78                          Indonesia              249866    64000.0
100                        Madagascar               22925    12000.0
115                        Mozambique               25834    18000.0
116                           Myanmar               53259    26000.0
124                           Nigeria              173615   160000.0
128                          Pakistan              182143    49000.0
134                       Philippines               98394    27000.0
141                Russian Federation              142834    17000.0
159                      South Africa               52776    25000.0
190                          Viet Nam               91680    17000.0

**there are two bitwise operators:**

values are True only if the equivalent rows in the dataframe contain the countries ‘Latvia’ to ‘Sweden’, inclusive

In [75]:
(df['Country'] >= 'Latvia') & (df['Country'] <= 'Sweden') # AND

0      False
1      False
2      False
3      False
4      False
       ...
189    False
190    False
191    False
192    False
193    False
Name: Country, Length: 194, dtype: bool

evaluates to True for all countries, because every country comes alphabetically after ‘Latvia’ (e.g. the ‘UK’) or before 'Sweden' (e.g. ‘Brazil’)

In [76]:
(df['Country'] >= 'Latvia') | (df['Country'] <= 'Sweden') # OR

0      True
1      True
2      True
3      True
4      True
       ...
189    True
190    True
191    True
192    True
193    True
Name: Country, Length: 194, dtype: bool

find the rows in df where 'Population (1000s)' is greater than 80000 and where 'TB deaths' are greater than 10000

In [77]:
df[(df['Population (1000s)'] > 80000) & (df['TB deaths'] > 10000)]

                Country  Population (1000s)  TB deaths
13           Bangladesh              156595    80000.0
36                China             1393337    41000.0
58             Ethiopia               94101    30000.0
77                India             1252140   240000.0
78            Indonesia              249866    64000.0
124             Nigeria              173615   160000.0
128            Pakistan              182143    49000.0
134         Philippines               98394    27000.0
141  Russian Federation              142834    17000.0
190            Viet Nam               91680    17000.0

can also be written in shorter code form:

In [78]:
population = df['Population (1000s)'] 

deaths = df['TB deaths']

df[(population > 80000) & (deaths > 10000)]

                Country  Population (1000s)  TB deaths
13           Bangladesh              156595    80000.0
36                China             1393337    41000.0
58             Ethiopia               94101    30000.0
77                India             1252140   240000.0
78            Indonesia              249866    64000.0
124             Nigeria              173615   160000.0
128            Pakistan              182143    49000.0
134         Philippines               98394    27000.0
141  Russian Federation              142834    17000.0
190            Viet Nam               91680    17000.0

find all the countries where the Population (1000s) is less than or equal to 50000 or TB deaths are greater than or equal to 20000

                                Country  Population (1000s)  TB deaths
0                           Afghanistan               30552   13000.00
1                               Albania                3173      20.00
2                               Algeria               39208    5100.00
3                               Andorra                  79       0.26
4                                Angola               21472    6900.00
..                                  ...                 ...        ...
188                             Vanuatu                 253      16.00
189  Venezuela (Bolivarian Republic of)               30405     480.00
191                               Yemen               24407     990.00
192                              Zambia               14539    3600.00
193                            Zimbabwe               14150    5700.00

[180 rows x 3 columns]

In [97]:
country = df['Country'] 
df[(country >= 'C') & (country < 'D')] # quiz q5

                     Country  Population (1000s)  TB deaths
28             Côte d'Ivoire               20316    4000.00
29                Cabo Verde                 499     150.00
30                  Cambodia               15135   10000.00
31                  Cameroon               22254    7800.00
32                    Canada               35182      62.00
33  Central African Republic                4616    2200.00
34                      Chad               12825    2900.00
35                     Chile               17620     220.00
36                     China             1393337   41000.00
37                  Colombia               48321     770.00
38                   Comoros                 735      58.00
39                     Congo                4448    2000.00
40              Cook Islands                  21       0.41
41                Costa Rica                4872      33.00
42                   Croatia                4290      52.00
43                      Cuba               11266      37.00
44                    Cyprus                1141       2.30
45            Czech Republic               10702      28.00

In [96]:
df[(country >= 'C') & (country < 'D') & (population < 1000)] # quiz q5

         Country  Population (1000s)  TB deaths
29    Cabo Verde                 499     150.00
38       Comoros                 735      58.00
40  Cook Islands                  21       0.41